{"_id":"d46c0840-d83b-11e8-a9f1-05b1ca7b5c0d","name":"Cintia","email":"e4ba6ac8bd12c44aaafd94487cc458b6","body":"Hi Marek, \r\n\r\nWell. No, I don't believe configuration is code. I don't even think build is configuration, but rather state. But turns out I've already wrote on it. \r\nhttps://cintia.me/blog/post/build-as-code/\r\n\r\nI'm not sure why you had the impression I'm not using Bamboo specs; I do have probably more than 20 builds using Bamboo specs, I've been personally attempting to get the rest of the company to adopt it, and I must say, it has been a pretty bad experience. \r\n\r\nI could get half of the company to do bits and pieces on cloudformation, even puppet, and monitoring. But bamboo specs has such a big learning curve for non-JVM developers, that it's hard to even grab people's attention. \r\n\r\nFor non-devs (manual QA, Ops) or even juniors from other languages, they cannot even understand where to start. We now even have a common library to try to minimize the pain, which it feels to me as a massive failure. I'm not even convinced it's any better than before. \r\n\r\nMy previous company decided to drop bamboo because of that; node and python developers couldn't even imagine they'd need to install eclipse and maven to change build configuration. I cannot blame them on that, while I still believe it was just the cherry on the top of the cake. \r\n\r\nI never needed modules for my plans. I needed macros (or templates), that's all. I never wanted a full blown SDK. I can do ansible, I can do terraform, and I never needed code completion or any fancy IDE. \r\n\r\nEvery single time I present a colleague with bamboo specs, I get side-eyes . I try to say that it's hard at the beginning, and it will eventually pay off. I say that because I want to believe, but it's a lie. I still hate every single time I need to change a Bamboo build. \r\n\r\nI know I'm not the only one: https://jira.atlassian.com/browse/BAM-15087\r\n\r\nBamboo has become a joke in the devops meetups. It's not really what I wanted to see. \r\n\r\nAnd the bamboo specs is broken. So many things are lacking there that it's almost useless.","date":"2018-10-25T09:53:31.677Z"}